# Import Libraries

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# Data Dictionary

- survival        0 = No, 1 = Yes
- pclass	      Ticket class	1 = 1st, 2 = 2nd, 3 = 3rd
    - pclass: A proxy for socio-economic status (SES)
       - 1st = Upper
       - 2nd = Middle
       - 3rd = Lower
- sex	          Sex	
- Age	          Age in years	
- sibsp	          # of siblings / spouses aboard the Titanic
    -sibsp: The dataset defines family relations in this way...
        - Sibling = brother, sister, stepbrother, stepsister
        - Spouse = husband, wife (mistresses and fianc√©s were ignored)

- parch	          # of parents / children aboard the Titanic	
    - parch: The dataset defines family relations in this way...
        - Parent = mother, father
        - Child = daughter, son, stepdaughter, stepson
        - Some children travelled only with a nanny, therefore parch=0 for them.
        
- ticket	      Ticket number	
- fare	          Passenger fare	
- cabin	          Cabin number	
- embarked	      Port of Embarkation	C = Cherbourg, Q = Queenstown, S = Southampton

## Import DataFiles

In [2]:
#kaggle_train = pd.read_csv('../DataSets/Kaggle/train.csv')
#kaggle_test = pd.read_csv('../DataSets/Kaggle/test.csv')
titanic_complete = pd.read_csv('../DataSets/TensorFlow/Titanic.csv')

In [3]:
titanic_complete.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29,0,0,24160,211.3375,B5,S,2,?,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.55,C22 C26,S,11,?,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2,1,2,113781,151.55,C22 C26,S,?,?,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30,1,2,113781,151.55,C22 C26,S,?,135,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25,1,2,113781,151.55,C22 C26,S,?,?,"Montreal, PQ / Chesterville, ON"

In [4]:
titanic_complete.shape

(1309, 14)

# Data Cleaning

In [5]:
# Dropping unwanted columns
titanic_complete=titanic_complete.drop(['name','ticket','cabin','body','boat','home.dest','embarked'],1)
titanic_complete

      pclass  survived     sex     age  sibsp  parch      fare
0          1         1  female      29      0      0  211.3375
1          1         1    male  0.9167      1      2    151.55
2          1         0  female       2      1      2    151.55
3          1         0    male      30      1      2    151.55
4          1         0  female      25      1      2    151.55
...      ...       ...     ...     ...    ...    ...       ...
1304       3         0  female    14.5      1      0   14.4542
1305       3         0  female       ?      1      0   14.4542
1306       3         0    male    26.5      0      0     7.225
1307       3         0    male      27      0      0     7.225
1308       3         0    male      29      0      0     7.875

[1309 rows x 7 columns]

### Finding Missing Values('?') and Fixing them

In [7]:
titanic_complete = titanic_complete.replace('?',np.nan)

In [8]:
titanic_complete.dtypes

pclass       int64
survived     int64
sex         object
age         object
sibsp        int64
parch        int64
fare        object
dtype: object

In [9]:
#Converting age and fare into float
titanic_complete['age'] = titanic_complete['age'].astype(float)
titanic_complete['fare'] = titanic_complete['fare'].astype(float)
titanic_complete.dtypes

pclass        int64
survived      int64
sex          object
age         float64
sibsp         int64
parch         int64
fare        float64
dtype: object

In [10]:
#View Missing Values
missing_data = titanic_complete.isnull().sum().sort_values(ascending = False)
missing_data

age         263
fare          1
parch         0
sibsp         0
sex           0
survived      0
pclass        0
dtype: int64

#### AGE

In [11]:
# Fill the missing values with the average of all Ages - MEAN
import math
mean = titanic_complete['age'].dropna().mean()
print(mean)
titanic_complete['age'] = titanic_complete['age'].fillna(math.ceil(mean))

29.8811345124283

### Embarked

# fill nan with Unknown - MODE
from statistics import mode
titanic_complete['embarked'] = titanic_complete['embarked'].fillna(mode(titanic_complete['embarked']))

### Fare

In [12]:
# fill nan with the most frequent values - MODE
from statistics import mode

titanic_complete['fare'] = titanic_complete['fare'].fillna(mode(titanic_complete['fare']))

In [13]:
#View Missing Values
missing_data = titanic_complete.isnull().sum().sort_values(ascending = False)
missing_data

fare        0
parch       0
sibsp       0
age         0
sex         0
survived    0
pclass      0
dtype: int64

In [14]:
data = titanic_complete.copy()
data_binary_encoded = pd.get_dummies(data, columns=["sex"])
data_binary_encoded.head()

   pclass  survived      age  sibsp  parch      fare  sex_female  sex_male
0       1         1  29.0000      0      0  211.3375           1         0
1       1         1   0.9167      1      2  151.5500           0         1
2       1         0   2.0000      1      2  151.5500           1         0
3       1         0  30.0000      1      2  151.5500           0         1
4       1         0  25.0000      1      2  151.5500           1         0

In [15]:
new_data = data_binary_encoded.drop(["sex_female"],axis=1)

In [ ]:
new_data

In [16]:
# Assign X (data) and y (target)
X = titanic_complete.drop('survived', axis = 1)
y = titanic_complete['survived']
print(X.shape, y.shape)

(1309, 6) (1309,)

In [17]:
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import LabelEncoder, MinMaxScaler ,OneHotEncoder
from tensorflow.keras.utils import to_categorical

In [18]:
X_train, X_test, y_train, y_test = train_test_split(
    new_data, y, random_state=1)

In [19]:
print(X.shape, y.shape)

(1309, 6) (1309,)

In [20]:
X_scaler = MinMaxScaler().fit(X_train)
X_train_scaled = X_scaler.transform(X_train)
X_test_scaled = X_scaler.transform(X_test)

In [22]:
from sklearn.linear_model import LogisticRegression
model_LogisticRegression = LogisticRegression()
model_LogisticRegression

LogisticRegression()

In [25]:

model_LogisticRegression.fit(X_train_scaled , y_train)

LogisticRegression()

In [26]:
print(f"Training Data Score: {model_LogisticRegression.score(X_train_scaled, y_train)}")
print(f"Testing Data Score: {model_LogisticRegression.score(X_test_scaled, y_test)}")

Training Data Score: 1.0
Testing Data Score: 1.0

In [27]:
predictions = model_LogisticRegression.predict(X_test)
pd.DataFrame({"Prediction": predictions, "Actual": y_test})

      Prediction  Actual
201            0       0
115            1       0
255            1       1
1103           0       0
195            1       1
...          ...     ...
34             0       0
85             1       1
984            0       1
156            0       0
670            0       0

[328 rows x 2 columns]

## Converting Categorical Data

In [ ]:
# Use Pandas get_dummies to convert categorical data

#titanic_complete = pd.get_dummies(titanic_complete)
#titanic_complete.head()

In [ ]:
# Remove Extra Categorical Columns

## Logistic Regression
Logistic Regression is a statistical method for predicting binary outcomes from data.

Examples of this are "yes" vs "no" or "young" vs "old". 

These are categories that translate to probability of being a 0 or a 1.

### Split Data into Training and Testing

In [ ]:
#from sklearn.model_selection import train_test_split

#X_train, X_test, y_train, y_test = train_test_split(X, y, random_state=1)